In [1]:
# 2.Pandas

In [2]:
# Pandas is a fast and efficient Dataframe object for data manipulation

In [3]:
# 2.1 Importing the package

In [17]:
import pandas as pd

In [5]:
# 2.2 Series

In [8]:
# These are 1D labelled ndarray capable of storing any datatype(int,float,string)

In [18]:
import numpy as np

countries = ['India', 'England', 'France']                 # Creating two lists contaning name of the country and its capital

capitals = ['New delhi', 'London', 'Paris']    

arr = np.array(capitals)                                  # Making an array with the list capitals

dicts = {'a':20, 'b':30, 'c':40, 'd':50, 'e':60, 'f':70, 'g':80, 'h':90}     # Defining a dictionary

In [12]:
# Creating a series from a list

In [20]:
pd.Series (data = capitals)                               # Creating pandas series

0    New delhi
1       London
2        Paris
dtype: object

In [21]:
pd.Series (data = capitals, index = countries)           # Modifying a series by adding index

India      New delhi
England       London
France         Paris
dtype: object

In [22]:
pd.Series (arr)

0    New delhi
1       London
2        Paris
dtype: object

In [23]:
pd.Series (dicts)

a    20
b    30
c    40
d    50
e    60
f    70
g    80
h    90
dtype: int64

In [24]:
# 2.2.1 Series Indexing

In [25]:
# Here you will observe hoe the elements of the series are indexed and how we can access any element index

In [28]:
my_series = pd.Series (dicts)

In [29]:
my_series.shape                                          # This series has 8 elements

(8,)

In [31]:
my_series [0]                                           # Series indexing starts with 0

20

In [32]:
my_series [:3]                                          # Accessing the first 3 elements in series

a    20
b    30
c    40
dtype: int64

In [33]:
my_series [3:7]                                        # Accessing all the elements from 3rd to 7th index

d    50
e    60
f    70
g    80
dtype: int64

In [34]:
my_series ['a']                                        # Accessing tha data using lables

20

In [35]:
my_series [['a', 'c', 'e']]                           # Accessing multiple elements in aseries using lables

a    20
c    40
e    60
dtype: int64

In [36]:
my_series + my_series                                 # Performing elelments wise mathematical oprations on series

a     40
b     60
c     80
d    100
e    120
f    140
g    160
h    180
dtype: int64

In [37]:
# 2.3 DataFrames

In [38]:
# Dataframes are 2D data structures having data aligned in tabular format.

In [40]:
df = pd.DataFrame()                                   # Creating an empty dataframe               

print (df)

Empty DataFrame
Columns: []
Index: []

In [41]:
fruits = ['Mango', 'Apple', 'Orange', 'Lemon']

fruits_df = pd.DataFrame (fruits, columns=['Fruit'])  # Columns is used to set the column name

fruits_df

    Fruit
0   Mango
1   Apple
2  Orange
3   Lemon

In [43]:
people = [['Mahesh',25,'O+'], ['Rudra',10,'O+'], ['Rani',24,'B+'], ['Mahira',15,'B+']]

people_df = pd.DataFrame (people, columns= ['Name', 'Age', 'Blood Group'])

people_df

     Name  Age Blood Group
0  Mahesh   25          O+
1   Rudra   10          O+
2    Rani   24          B+
3  Mahira   15          B+

In [45]:
people = {'Name':['Mahesh', 'Rudra', 'Rani', 'Mahira'], 'Age':[25,10,24,15], 'Blood Group':['O+', 'O+', 'B+', 'B+']}

people_df = pd.DataFrame (people)

people_df

     Name  Age Blood Group
0  Mahesh   25          O+
1   Rudra   10          O+
2    Rani   24          B+
3  Mahira   15          B+

In [46]:
# 2.3.1 Loading files into DataFrame

In [49]:
# DataFrame can load data from many types of files like csv,excel sheets,text,etc.

In [51]:
csv_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv') # read_csv is used to read csv file

csv_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [61]:
json_df = pd.read_json('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.json')                             # read_json is used to read json file

json_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [63]:
# Data structure serparated by semi-colon

In [65]:
txt_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets-semi-colons.txt', sep=';')            # sep is used to separate the dataset

txt_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [66]:
web_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv')            # write the url of the csv file within ''.

web_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [67]:
# 2.3.2 Attributes of a DataFrame

In [68]:
# After loading yoyr dataframe you m,ay be intrested to know the columns,shape, datatypes.

In [69]:
people_df.shape                               # Shape function is used to know the dimensions

(4, 3)

In [70]:
print (people_df.dtypes)                      # Dtypes function for information about layout

Name           object
Age             int64
Blood Group    object
dtype: object

In [71]:
people_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         4 non-null      object
 1   Age          4 non-null      int64
 2   Blood Group  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [72]:
people_df.count()

Name           4
Age            4
Blood Group    4
dtype: int64

In [73]:
people_df.index

RangeIndex(start=0, stop=4, step=1)

In [74]:
people_df.columns

Index(['Name', 'Age', 'Blood Group'], dtype='object')

In [75]:
newe_people_df = people_df.set_index ('Name')

newe_people_df

        Age Blood Group
Name
Mahesh   25          O+
Rudra    10          O+
Rani     24          B+
Mahira   15          B+

In [76]:
# 2.3.3 Selection, Addition and Deletion

In [77]:
# Selecting a row or a column, adding column to existing dataframe. and deleting a row or column

In [78]:
people_df ['Blood Group']                             # Column selection

0    O+
1    O+
2    B+
3    B+
Name: Blood Group, dtype: object

In [79]:
people_df ['score'] = [20,40,60,70]                  # adding a new column

people_df

     Name  Age Blood Group  score
0  Mahesh   25          O+     20
1   Rudra   10          O+     40
2    Rani   24          B+     60
3  Mahira   15          B+     70

In [81]:
people_df ['Sum'] = people_df ['score'] + people_df ['Age']       # Addition of two column. yopu can perfrom any math opration

people_df

     Name  Age Blood Group  score  Sum
0  Mahesh   25          O+     20   45
1   Rudra   10          O+     40   50
2    Rani   24          B+     60   84
3  Mahira   15          B+     70   85

In [84]:
people_df.drop ('Sum', axis=1)                  

people_df

     Name  Age Blood Group  score  Sum
0  Mahesh   25          O+     20   45
1   Rudra   10          O+     40   50
2    Rani   24          B+     60   84
3  Mahira   15          B+     70   85

In [87]:
people_df.drop('Sum', axis=1, inplace=True)           # Drop sum and modify the dataframe

people_df

     Name  Age Blood Group  score
0  Mahesh   25          O+     20
1   Rudra   10          O+     40
2    Rani   24          B+     60
3  Mahira   15          B+     70

In [88]:
del people_df ['score']                              # Column deletion using del

In [90]:
new_people_df = people_df.set_index('Name')          # Creates a new df with name set as index

new_people_df

        Age Blood Group
Name
Mahesh   25          O+
Rudra    10          O+
Rani     24          B+
Mahira   15          B+

In [92]:
people_df.drop (['Blood Group'],1)                   # Droping 'Bllod Group' column

     Name  Age
0  Mahesh   25
1   Rudra   10
2    Rani   24
3  Mahira   15

In [95]:
new_people_df.drop ('Rudra', axis=0)                 # Row deletion using row index

        Age Blood Group
Name
Mahesh   25          O+
Rani     24          B+
Mahira   15          B+

In [96]:
# 2.3.4 Indexing in dataframe

In [98]:
# Using numbers record or columns index using iloc and using names record name or column name using loc

In [99]:
market_df = pd.read_csv('http://pythonhow.com/supermarkets.csv')

market_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [100]:
market_df = market_df.set_index ('ID')                                # Use the ID column as index

In [101]:
market_df.iloc [0:4, 0:5]                                            # It will returns from 0-4 and column from 0-5

           Address           City             State Country         Name
ID
1     3666 21st St  San Francisco          CA 94114     USA      Madeira
2   735 Dolores St  San Francisco          CA 94119     USA  Bready Shop
3      332 Hill St  San Francisco  California 94114     USA  Super River
4     3995 23rd St  San Francisco          CA 94114     USA   Ben's Shop

In [102]:
market_df.iloc [:, 0:5]                                             # Return the column from 0-5

            Address           City             State Country         Name
ID
1      3666 21st St  San Francisco          CA 94114     USA      Madeira
2    735 Dolores St  San Francisco          CA 94119     USA  Bready Shop
3       332 Hill St  San Francisco  California 94114     USA  Super River
4      3995 23rd St  San Francisco          CA 94114     USA   Ben's Shop
5   1056 Sanchez St  San Francisco        California     USA      Sanchez
6   551 Alvarado St  San Francisco          CA 94114     USA   Richvalley

In [103]:
market_df.iloc [0:4, :]                                             # return all the rows from 0-4

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [104]:
market_df.loc [1:4, "Address"]                                     # Returns ID 1-4 and column address

ID
1      3666 21st St
2    735 Dolores St
3       332 Hill St
4      3995 23rd St
Name: Address, dtype: object

In [105]:
market_df.loc [1:4, "Address": "Country"]                        # Returns ID 1-4 column address to country

           Address           City             State Country
ID
1     3666 21st St  San Francisco          CA 94114     USA
2   735 Dolores St  San Francisco          CA 94119     USA
3      332 Hill St  San Francisco  California 94114     USA
4     3995 23rd St  San Francisco          CA 94114     USA

In [107]:
market_df.loc [:, "State" :]                                     # Returns all the column from state onwards and all the rows

               State Country         Name  Employees
ID
1           CA 94114     USA      Madeira          8
2           CA 94119     USA  Bready Shop         15
3   California 94114     USA  Super River         25
4           CA 94114     USA   Ben's Shop         10
5         California     USA      Sanchez         12
6           CA 94114     USA   Richvalley         20

In [125]:
# 2.3.5 Merging, Concatenating and Appending

In [133]:
# We saw how to add rows or columns. here will see how to merge two dataframes

In [134]:
df1 = pd.DataFrame({                                            # Lets create 2 dataframes
    'id':[11,12,13,14,15],
    'name':['Mahesh','Rudra','Rani','Mahira','Kemal'],
    'sub':['English','Math','Marathi','science','History']
})
df2 = pd.DataFrame({
    'id':[11,12,13,14,15],
    'name':['Rudra','Rani','Mahira','Kemal','Nihan'],
    'sub':['Marathi','Science','History','Hindi','Algebra']
})

In [135]:
pd.concat([df1, df2], axis=0)                                  # Joining two DataFrame along the rows

   id    name      sub
0  11  Mahesh  English
1  12   Rudra     Math
2  13    Rani  Marathi
3  14  Mahira  science
4  15   Kemal  History
0  11   Rudra  Marathi
1  12    Rani  Science
2  13  Mahira  History
3  14   Kemal    Hindi
4  15   Nihan  Algebra

In [136]:
pd.concat ([df1, df2], axis=1)                                 # Joining 2 Dataframe alomg the columns

   id    name      sub  id    name      sub
0  11  Mahesh  English  11   Rudra  Marathi
1  12   Rudra     Math  12    Rani  Science
2  13    Rani  Marathi  13  Mahira  History
3  14  Mahira  science  14   Kemal    Hindi
4  15   Kemal  History  15   Nihan  Algebra

In [137]:
pd.merge (left=df1, right=df2, on='sub')                       # Joining 2 Dataframe using sub as key

   id_x name_x      sub  id_y  name_y
0    13   Rani  Marathi    11   Rudra
1    15  Kemal  History    13  Mahira

In [142]:
pd.merge (left=df1, right=df2, on='id')

   id  name_x    sub_x  name_y    sub_y
0  11  Mahesh  English   Rudra  Marathi
1  12   Rudra     Math    Rani  Science
2  13    Rani  Marathi  Mahira  History
3  14  Mahira  science   Kemal    Hindi
4  15   Kemal  History   Nihan  Algebra

In [144]:
df3 = pd.DataFrame({'id':[20],                                  # Lets modify our row to a DataFrame
                    'name':['Watson'], 
                    'sub':['Geo']})
df3

   id    name  sub
0  20  Watson  Geo

In [145]:
df1

   id    name      sub
0  11  Mahesh  English
1  12   Rudra     Math
2  13    Rani  Marathi
3  14  Mahira  science
4  15   Kemal  History

In [146]:
df4 = df1

df5 = df3

df4.append(df5)

   id    name      sub
0  11  Mahesh  English
1  12   Rudra     Math
2  13    Rani  Marathi
3  14  Mahira  science
4  15   Kemal  History
0  20  Watson      Geo

In [147]:
df4 = df1

df5 = df3

df4.append(df5, ignore_index = True)

   id    name      sub
0  11  Mahesh  English
1  12   Rudra     Math
2  13    Rani  Marathi
3  14  Mahira  science
4  15   Kemal  History
5  20  Watson      Geo

In [148]:
# 2.3.6 Conditional in DataFrame

In [149]:
# This used perfroom comparision on the records and boolean datatypes. then filter out from the dataframe

In [152]:
market_df['Employees'] >=15                                       # This returns a boolean series

ID
1    False
2     True
3     True
4    False
5    False
6     True
Name: Employees, dtype: bool

In [156]:
market_df [market_df['Employees'] >=15]                          # This returns all the rows for which the conditional is true

,Address,City,State,Country,Name,Employees
ID,,,,,,
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [157]:
market_df[(market_df['Employees'] >=15) & (market_df['State'] != 'CA 94119')]     # It will return rows where both the conditions are satisfied.

,Address,City,State,Country,Name,Employees
ID,,,,,,
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [158]:
# 2.3.7 Multi index DataFrame

In [159]:
# Until now you have seen dataFrame with a single index. we use more than 1 index to gain better insights.

In [181]:
Company = ['IBM', 'IBM', 'IBM', 'Netflix', 'Netflix', 'Netflix']

Year = [2001,2004,2006,2001,2004,2006]

Revenue = [20,45,30,12,85,35]

Employee = [400,550,750,900,350,630]

In [182]:
list (zip(Revenue, Employee))                           # Zip will collect one value of its container

[(20, 400), (45, 550), (30, 750), (12, 900), (85, 350), (35, 630)]

In [183]:
list (zip(Company, Year))

[('IBM', 2001),
 ('IBM', 2004),
 ('IBM', 2006),
 ('Netflix', 2001),
 ('Netflix', 2004),
 ('Netflix', 2006)]

In [185]:
hier_index = list(zip(Company, Year))                  # These pair value will be our 2 indices

In [186]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

hier_index

MultiIndex([(    'IBM', 2001),
            (    'IBM', 2004),
            (    'IBM', 2006),
            ('Netflix', 2001),
            ('Netflix', 2004),
            ('Netflix', 2006)],
           )

In [187]:
multi_index_df = pd.DataFrame (data = list (zip(Revenue, Employee)), index = hier_index, columns = ['Revemue', 'Employee'])

multi_index_df

              Revemue  Employee
IBM     2001       20       400
        2004       45       550
        2006       30       750
Netflix 2001       12       900
        2004       85       350
        2006       35       630

In [188]:
multi_index_df.index.names = ['Company', 'Year']                    # Rename our indices to company and year

multi_index_df

              Revemue  Employee
Company Year
IBM     2001       20       400
        2004       45       550
        2006       30       750
Netflix 2001       12       900
        2004       85       350
        2006       35       630

In [189]:
multi_index_df.loc['IBM']                                        # Accessing data using our first index

      Revemue  Employee
Year
2001       20       400
2004       45       550
2006       30       750

In [190]:
multi_index_df.loc ['IBM'].loc [2004]                         # Accessing data using first index and then second index

Revemue      45
Employee    550
Name: 2004, dtype: int64

In [191]:
multi_index_df.xs ('Netflix', level = 'Company')      # accessing data based on index level(either from first or second index)

      Revemue  Employee
Year
2001       12       900
2004       85       350
2006       35       630

In [200]:
multi_index_df.xs (2006, level = 'Year')               # Acessing data based on index level

         Revemue  Employee
Company
IBM           30       750
Netflix       35       630

In [213]:
# 2.3.8 Groupby

In [214]:
# Groupby allows you to group together rows based on column and perfrom an aggregate function on them

In [215]:
people = [['Mahesh',24, 'O+'], ['Rudra', 10, 'O+'], ['Rani', 24,'B+'], ['Mahira',15,'B+']]
people_df = pd.DataFrame(people, columns=['Name','Score', 'Blood Group'])
people_df

     Name  Score Blood Group
0  Mahesh     24          O+
1   Rudra     10          O+
2    Rani     24          B+
3  Mahira     15          B+

In [216]:
def times2 (x) :                                          # We are going to apply this function
    
    return x * 2

In [217]:
people_df ['Score'].apply(times2)                        # Applying times2() function a column of dataframe

0    48
1    20
2    48
3    30
Name: Score, dtype: int64

In [219]:
people_df ['Score'].apply(lambda x: x * 2)              # Applying lambda fuction on colukn of dataframe

0    48
1    20
2    48
3    30
Name: Score, dtype: int64

In [220]:
people_df.sort_values ('Score')                        # Sorting the records based on a column

     Name  Score Blood Group
1   Rudra     10          O+
3  Mahira     15          B+
0  Mahesh     24          O+
2    Rani     24          B+

In [221]:
# 2.4 Time series in pandas

In [223]:
# We will explore datatime function by pandas and how efficient it is ro analyse time series data

In [224]:
air_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/AirQualityUCI.csv')  # Import the Dataset

In [225]:
air_df.describe (include = 'all')

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
count,9357,9357,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000
unique,391,24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,2/9/2005,2:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,24,390,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,-34.207524,1048.990061,-159.090093,1.865683,894.595276,168.616971,794.990168,58.148873,1391.479641,975.072032,9.778305,39.485380,-6.837604
std,NaN,NaN,77.657170,329.832710,139.789093,41.380206,342.333252,257.433866,321.993552,126.940455,467.210125,456.938184,43.203623,51.216145,38.976670
min,NaN,NaN,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000
25%,NaN,NaN,0.600000,921.000000,-200.000000,4.000000,711.000000,50.000000,637.000000,53.000000,1185.000000,700.000000,10.900000,34.100000,0.692300
50%,NaN,NaN,1.500000,1053.000000,-200.000000,7.900000,895.000000,141.000000,794.000000,96.000000,1446.000000,942.000000,17.200000,48.600000,0.976800
75%,NaN,NaN,2.600000,1221.000000,-200.000000,13.600000,1105.000000,284.000000,960.000000,133.000000,1662.000000,1255.000000,24.100000,61.900000,1.296200
max,NaN,NaN,11.900000,2040.000000,1189.000000,63.700000,2214.000000,1479.000000,2683.000000,340.000000,2775.000000,2523.000000,44.600000,88.700000,2.231000

In [226]:
air_df.head()                                 # Observe the columns and rows of the dataset

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,3/10/2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,3/10/2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,3/10/2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

In [228]:
air_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   int64
 4   NMHC(GT)       9357 non-null   int64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   int64
 7   NOx(GT)        9357 non-null   int64
 8   PT08.S3(NOx)   9357 non-null   int64
 9   NO2(GT)        9357 non-null   int64
 10  PT08.S4(NO2)   9357 non-null   int64
 11  PT08.S5(O3)    9357 non-null   int64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: float64(5), int64(8), object(2)
memory usage: 1023.5+ KB

In [229]:
air_df['Date'] = pd.to_datetime(air_df['Date'], format='%m/%d/%Y')

In [230]:
air_df ['Time'].unique()

array(['18:00:00', '19:00:00', '20:00:00', '21:00:00', '22:00:00',
       '23:00:00', '0:00:00', '1:00:00', '2:00:00', '3:00:00', '4:00:00',
       '5:00:00', '6:00:00', '7:00:00', '8:00:00', '9:00:00', '10:00:00',
       '11:00:00', '12:00:00', '13:00:00', '14:00:00', '15:00:00',
       '16:00:00', '17:00:00'], dtype=object)

In [231]:
air_df [air_df ['NMHC(GT)']==-200].count()

Date             8443
Time             8443
CO(GT)           8443
PT08.S1(CO)      8443
NMHC(GT)         8443
C6H6(GT)         8443
PT08.S2(NMHC)    8443
NOx(GT)          8443
PT08.S3(NOx)     8443
NO2(GT)          8443
PT08.S4(NO2)     8443
PT08.S5(O3)      8443
T                8443
RH               8443
AH               8443
dtype: int64

In [233]:
air_df.drop (['NMHC(GT)'], axis=1)

,Date,Time,CO(GT),PT08.S1(CO),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,2004-03-10,18:00:00,2.6,1360,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,2004-03-10,19:00:00,2.0,1292,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,2004-03-10,20:00:00,2.2,1402,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,2004-03-10,21:00:00,2.2,1376,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,2004-03-10,22:00:00,1.6,1272,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9352,2005-04-04,10:00:00,3.1,1314,13.5,1101,472,539,190,1374,1729,21.9,29.3,0.7568
9353,2005-04-04,11:00:00,2.4,1163,11.4,1027,353,604,179,1264,1269,24.3,23.7,0.7119
9354,2005-04-04,12:00:00,2.4,1142,12.4,1063,293,603,175,1241,1092,26.9,18.3,0.6406
9355,2005-04-04,13:00:00,2.1,1003,9.5,961,235,702,156,1041,770,28.3,13.5,0.5139
9356,2005-04-04,14:00:00,2.2,1071,11.9,1047,265,654,168,1129,816,28.5,13.1,0.5028

In [234]:
air_df['Time'] = pd.to_datetime(air_df['Time'], format = '%H:%M:%S')

In [235]:
air_df.dtypes                                               # First check for our date and time column

Date             datetime64[ns]
Time             datetime64[ns]
CO(GT)                  float64
PT08.S1(CO)               int64
NMHC(GT)                  int64
C6H6(GT)                float64
PT08.S2(NMHC)             int64
NOx(GT)                   int64
PT08.S3(NOx)              int64
NO2(GT)                   int64
PT08.S4(NO2)              int64
PT08.S5(O3)               int64
T                       float64
RH                      float64
AH                      float64
dtype: object

In [237]:
year = air_df.Date.dt.year                                    # Extracting year from date column

print(year.head())

0    2004
1    2004
2    2004
3    2004
4    2004
Name: Date, dtype: int64

In [239]:
month = air_df.Date.dt.month                                  # Extracting month from date column

print(month.head())

0    3
1    3
2    3
3    3
4    3
Name: Date, dtype: int64

In [240]:
month.nunique()                                              # Counting the number of months

12

In [242]:
day = air_df.Date.dt.day                                     # Extracting day from data column

print(day.head())

0    10
1    10
2    10
3    10
4    10
Name: Date, dtype: int64

In [243]:
day.nunique()                                                 # Counting the number of days

31

In [247]:
# the index of week days are provided below
# 0 = Monday
# 1 = Tuesday
# 2 = wednesday
# 3 = Thursday
# 4 = Friday
# 5 = Saturday
# 6 = Sunday

In [253]:
day_of_week = air_df.Date.dt.dayofweek                        # Extracting the day of the week number

print (day_of_week.head())

0    2
1    2
2    2
3    2
4    2
Name: Date, dtype: int64

In [254]:
day_of_year = air_df.Date.dt.dayofyear                       # Extracting the day of the year

print(day_of_year.head())

0    70
1    70
2    70
3    70
4    70
Name: Date, dtype: int64

In [255]:
hour = air_df.Time.dt.hour                                    # Extracting the hour from time

print (hour.head())

0    18
1    19
2    20
3    21
4    22
Name: Time, dtype: int64

In [256]:
hour.nunique()                                                # Extracting the number of hours

24

In [257]:
minute = air_df.Time.dt.minute                                # Extracting the minute from the time

print(minute.head())

0    0
1    0
2    0
3    0
4    0
Name: Time, dtype: int64

In [258]:
# Conclusion

In [259]:
# Pandas is one of those packages, and makes omporting and analyzing data much easier.

In [260]:
# It is open source, BSD -licenseed python library providing high perfrmance, easy to use data structure data python program